Revit 2027 API
PointCollection Methods
The PointCollection type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPointBufferPointer |  Returns an unsafe pointer to the buffer in which this collection stores the points.
GetPointIterator |  Creates and returns an iterator for the points contained in this collection.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace